Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/SCB_356.0.xml
<module id="SCB" HW_revision="356.0">
    <register id="CPUID" width="32" offset="0xD00" internal="0" description="CPUID Base Register">
        <bitfield id="REVISION" description="Implementation defined revision number." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="PARTNO" description="Number of processor within family." begin="15" end="4" width="12" rwaccess="R">
        </bitfield>
        <bitfield id="CONSTANT" description="Reads as 0xC" begin="19" end="16" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="VARIANT" description="Implementation defined variant number." begin="23" end="20" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="IMPLEMENTER" description="Implementor code." begin="31" end="24" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="ICSR" width="32" offset="0xD04" internal="0" description="Interrupt Control State Register">
        <bitfield id="VECTACTIVE" description="Active ISR number field. Reset clears the VECTACTIVE field." begin="8" end="0" width="9" rwaccess="R">
        </bitfield>
        <bitfield id="RETTOBASE" description="This bit is 1 when the set of all active exceptions minus the IPSR_current_exception yields the empty set." begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="VECTPENDING" description="Pending ISR number field. VECTPENDING contains the interrupt number of the highest priority pending ISR." begin="17" end="12" width="6" rwaccess="R">
        </bitfield>
        <bitfield id="ISRPENDING" description="Interrupt pending flag. Excludes NMI and faults." begin="22" end="22" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="interrupt not pending"/>
            <bitenum id="en_0b1" value="0x1" description="interrupt pending"/>
        </bitfield>
        <bitfield id="ISRPREEMPT" description="You must only use this at debug time. It indicates that a pending interrupt is to be taken in the next running cycle. If C_MASKINTS is clear in the Debug Halting Control and Status Register, the interrupt is serviced." begin="23" end="23" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="a pending exception is not serviced."/>
            <bitenum id="en_0b1" value="0x1" description="a pending exception is serviced on exit from the debug halt state"/>
        </bitfield>
        <bitfield id="PENDSTCLR" description="Clear pending SysTick bit" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="do not clear pending SysTick"/>
            <bitenum id="en_0b1" value="0x1" description="clear pending SysTick"/>
        </bitfield>
        <bitfield id="PENDSTSET" description="Set a pending SysTick bit." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="do not set pending SysTick"/>
            <bitenum id="en_0b1" value="0x1" description="set pending SysTick"/>
        </bitfield>
        <bitfield id="PENDSVCLR" description="Clear pending pendSV bit" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="do not clear pending pendSV"/>
            <bitenum id="en_0b1" value="0x1" description="clear pending pendSV"/>
        </bitfield>
        <bitfield id="PENDSVSET" description="Set pending pendSV bit." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="do not set pending pendSV"/>
            <bitenum id="en_0b1" value="0x1" description="set pending PendSV"/>
        </bitfield>
        <bitfield id="NMIPENDSET" description="Set pending NMI bit. NMIPENDSET pends and activates an NMI. Because NMI is the highest-priority interrupt, it takes effect as soon as it registers." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="do not set pending NMI"/>
            <bitenum id="en_0b1" value="0x1" description="set pending NMI"/>
        </bitfield>
    </register>
    <register id="VTOR" width="32" offset="0xD08" internal="0" description="Vector Table Offset Register">
        <bitfield id="TBLOFF" description="Vector table base offset field. Contains the offset of the table base from the bottom of the SRAM or CODE space." begin="28" end="7" width="22" rwaccess="R/W">
        </bitfield>
        <bitfield id="TBLBASE" description="Table base is in Code (0) or RAM (1)." begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="AIRCR" width="32" offset="0xD0C" internal="0" description="Application Interrupt/Reset Control Register">
        <bitfield id="VECTRESET" description="System Reset bit. Resets the system, with the exception of debug components. The VECTRESET bit self-clears. Reset clears the VECTRESET bit. For debugging, only write this bit when the core is halted." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="VECTCLRACTIVE" description="Clears all active state information for active NMI, fault, and interrupts.  It is the responsibility of the application to reinitialize the stack. The VECTCLRACTIVE bit is for returning to a known state during debug. The VECTCLRACTIVE bit self-clears. IPSR is not cleared by this operation. So, if used by an application, it must only be used at the base level of activation, or within a system handler whose active bit can be set." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYSRESETREQ" description="Causes a signal to be asserted to the outer system that indicates a reset is requested. Intended to force a large system reset of all major components except for debug. Setting this bit does not prevent Halting Debug from running." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRIGROUP" description="Interrupt priority grouping field. The PRIGROUP field is a binary point position indicator for creating subpriorities for exceptions that share the same pre-emption level. It divides the PRI_n field in the Interrupt Priority Register into a pre-emption level and a subpriority level. The binary point is a left-of value. This means that the PRIGROUP value represents a point starting at the left of the Least Significant Bit (LSB). This is bit [0] of 7:0. The lowest value might not be 0 depending on the number of bits allocated for priorities, and implementation choices" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENDIANESS" description="Data endianness bit. ENDIANNESS is sampled from the BIGEND input port during reset. You cannot change ENDIANNESS outside of reset." begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="little endian"/>
            <bitenum id="en_0b1" value="0x1" description="big endian"/>
        </bitfield>
        <bitfield id="VECTKEY" description="Register key. Writing to this register requires 0x5FA in the VECTKEY field. Otherwise the write value is ignored." begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SCR" width="32" offset="0xD10" internal="0" description="System Control Register">
        <bitfield id="SLEEPONEXIT" description="Sleep on exit when returning from Handler mode to Thread mode. Enables interrupt driven applications to avoid returning to empty main application." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="do not sleep when returning to thread mode"/>
            <bitenum id="en_0b1" value="0x1" description="sleep on ISR exit"/>
        </bitfield>
        <bitfield id="SLEEPDEEP" description="Sleep deep bit." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="not OK to turn off system clock"/>
            <bitenum id="en_0b1" value="0x1" description="indicates to the system that Cortex-M4 clock can be stopped. Setting this bit causes the SLEEPDEEP port to be asserted when the processor can be stopped."/>
        </bitfield>
        <bitfield id="SEVONPEND" description="When enabled, this causes WFE to wake up when an interrupt moves from inactive to pended. Otherwise, WFE only wakes up from an event signal, external and SEV instruction generated. The event input, RXEV, is registered even when not waiting for an event, and so effects the next WFE." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="CCR" width="32" offset="0xD14" internal="0" description="Configuration Control Register">
        <bitfield id="NONBASETHREDENA" description="When 0, default, It is only possible to enter Thread mode when returning from the last exception. When set to 1, Thread mode can be entered from any level in Handler mode by controlled return value." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="USERSETMPEND" description="If written as 1, enables user code to write the Software Trigger Interrupt register to trigger (pend) a Main exception, which is one associated with the Main stack pointer." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="UNALIGN_TRP" description="Trap for unaligned access. This enables faulting/halting on any unaligned half or full word access. Unaligned load-store multiples always fault. The relevant Usage Fault Status Register bit is UNALIGNED." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DIV_0_TRP" description="Trap on Divide by 0. This enables faulting/halting when an attempt is made to divide by 0. The relevant Usage Fault Status Register bit is DIVBYZERO." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BFHFNMIGN" description="When enabled, this causes handlers running at priority -1 and -2 (Hard Fault, NMI, and FAULTMASK escalated handlers) to ignore Data Bus faults caused by load and store instructions. When disabled, these bus faults cause a lock-up. You must only use this enable with extreme caution. All data bus faults are ignored therefore you must only use it when the handler and its data are in absolutely safe memory. Its normal use is to probe system devices and bridges to detect control path problems and fix them." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="STKALIGN" description="Stack alignment bit." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="Only 4-byte alignment is guaranteed for the SP used prior to the exception on exception entry."/>
            <bitenum id="en_0b1" value="0x1" description="On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned and the context to restore it is saved. The SP is restored on the associated exception return."/>
        </bitfield>
    </register>
    <register id="SHPR1" width="32" offset="0xD18" internal="0" description="System Handlers 4-7 Priority Register">
        <bitfield id="PRI_4" description="Priority of system handler 4." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_5" description="Priority of system handler 5." begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_6" description="Priority of system handler 6." begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_7" description="Priority of system handler 7." begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
    </register>
