Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/SCB_356.0.xml
    <register id="SHPR2" width="32" offset="0xD1C" internal="0" description="System Handlers 8-11 Priority Register">
        <bitfield id="PRI_8" description="Priority of system handler 8." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_9" description="Priority of system handler 9." begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_10" description="Priority of system handler 10." begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_11" description="Priority of system handler 11." begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHPR3" width="32" offset="0xD20" internal="0" description="System Handlers 12-15 Priority Register">
        <bitfield id="PRI_12" description="Priority of system handler 12." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_13" description="Priority of system handler 13." begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_14" description="Priority of system handler 14." begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRI_15" description="Priority of system handler 15." begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHCSR" width="32" offset="0xD24" internal="0" description="System Handler Control and State Register">
        <bitfield id="MEMFAULTACT" description="MemManage active flag." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="BUSFAULTACT" description="BusFault active flag." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="USGFAULTACT" description="UsageFault active flag." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="SVCALLACT" description="SVCall active flag." begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="MONITORACT" description="the Monitor active flag." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="PENDSVACT" description="PendSV active flag." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="SYSTICKACT" description="SysTick active flag." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not active"/>
            <bitenum id="en_0b1" value="0x1" description="active"/>
        </bitfield>
        <bitfield id="USGFAULTPENDED" description="usage fault pended flag." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not pended"/>
            <bitenum id="en_0b1" value="0x1" description="pended"/>
        </bitfield>
        <bitfield id="MEMFAULTPENDED" description="MemManage pended flag." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not pended"/>
            <bitenum id="en_0b1" value="0x1" description="pended"/>
        </bitfield>
        <bitfield id="BUSFAULTPENDED" description="BusFault pended flag." begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not pended"/>
            <bitenum id="en_0b1" value="0x1" description="pended"/>
        </bitfield>
        <bitfield id="SVCALLPENDED" description="SVCall pended flag." begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="not pended"/>
            <bitenum id="en_0b1" value="0x1" description="pended"/>
        </bitfield>
        <bitfield id="MEMFAULTENA" description="MemManage fault system handler enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="disabled"/>
            <bitenum id="en_0b1" value="0x1" description="enabled"/>
        </bitfield>
        <bitfield id="BUSFAULTENA" description="Bus fault system handler enable" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="disabled"/>
            <bitenum id="en_0b1" value="0x1" description="enabled"/>
        </bitfield>
        <bitfield id="USGFAULTENA" description="Usage fault system handler enable" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="disabled"/>
            <bitenum id="en_0b1" value="0x1" description="enabled"/>
        </bitfield>
    </register>
    <register id="CFSR" width="32" offset="0xD28" internal="0" description="Configurable Fault Status Registers">
        <bitfield id="IACCVIOL" description="Instruction access violation flag. Attempting to fetch an instruction from a location that does not permit execution sets the IACCVIOL flag. This occurs on any access to an XN region, even when the MPU is disabled or not present. The return PC points to the faulting instruction. The MMAR is not written." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DACCVIOL" description="Data access violation flag. Attempting to load or store at a location that does not permit the operation sets the DACCVIOL flag. The return PC points to the faulting instruction. This error loads MMAR with the address of the attempted access." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MUNSTKERR" description="Unstack from exception return has caused one or more access violations. This is chained to the handler, so that the original return stack is still present. SP is not adjusted from failing return and new save is not performed. The MMAR is not written." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MSTKERR" description="Stacking from exception has caused one or more access violations. The SP is still adjusted and the values in the context area on the stack might be incorrect. The MMAR is not written." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MMARVALID" description="Memory Manage Address Register (MMAR) address valid flag. A later-arriving fault, such as a bus fault, can clear a memory manage fault.. If a MemManage fault occurs that is escalated to a Hard Fault because of priority, the Hard Fault handler must clear this bit. This prevents problems on return to a stacked active MemManage handler whose MMAR value has been overwritten." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IBUSERR" description="Instruction bus error flag. The IBUSERR flag is set by a prefetch error. The fault stops on the instruction, so if the error occurs under a branch shadow, no fault occurs. The BFAR is not written." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRECISERR" description="Precise data bus error return." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IMPRECISERR" description="Imprecise data bus error. It is a BusFault, but the Return PC is not related to the causing instruction. This is not a synchronous fault. So, if detected when the priority of the current activation is higher than the Bus Fault, it only pends. Bus fault activates when returning to a lower priority activation. If a precise fault occurs before returning to a lower priority exception, the handler detects both IMPRECISERR set and one of the precise fault status bits set at the same time. The BFAR is not written." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="UNSTKERR" description="Unstack from exception return has caused one or more bus faults. This is chained to the handler, so that the original return stack is still present. SP is not adjusted from failing return and new save is not performed. The BFAR is not written." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="STKERR" description="Stacking from exception has caused one or more bus faults. The SP is still adjusted and the values in the context area on the stack might be incorrect. The BFAR is not written." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BFARVALID" description="This bit is set if the Bus Fault Address Register (BFAR) contains a valid address. This is true after a bus fault where the address is known. Other faults can clear this bit, such as a Mem Manage fault occurring later. If a Bus fault occurs that is escalated to a Hard Fault because of priority, the Hard Fault handler must clear this bit. This prevents problems if returning to a stacked active Bus fault handler whose BFAR value has been overwritten." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="UNDEFINSTR" description="The UNDEFINSTR flag is set when the processor attempts to execute an undefined instruction. This is an instruction that the processor cannot decode. The return PC points to the undefined instruction." begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INVSTATE" description="Invalid combination of EPSR and instruction, for reasons other than UNDEFINED instruction. Return PC points to faulting instruction, with the invalid state." begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INVPC" description="Attempt to load EXC_RETURN into PC illegally. Invalid instruction, invalid context, invalid value. The return PC points to the instruction that tried to set the PC." begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="NOCP" description="Attempt to use a coprocessor instruction. The processor does not support coprocessor instructions." begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="UNALIGNED" description="When UNALIGN_TRP is enabled (see Configuration Control Register on page 8-26), and there is an attempt to make an unaligned memory access, then this fault occurs. Unaligned LDM/STM/LDRD/STRD instructions always fault irrespective of the setting of UNALIGN_TRP." begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DIVBYZERO" description="When DIV_0_TRP (see Configuration Control Register on page 8-26) is enabled and an SDIV or UDIV instruction is used with a divisor of 0, this fault occurs The instruction is executed and the return PC points to it. If DIV_0_TRP is not set, then the divide returns a quotient of 0." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MLSPERR" description="Indicates if MemManage fault occurred during FP lazy state preservation." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LSPERR" description="Indicates if bus fault occurred during FP lazy state preservation." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HFSR" width="32" offset="0xD2C" internal="0" description="Hard Fault Status Register">
        <bitfield id="VECTTBL" description="This bit is set if there is a fault because of vector table read on exception processing (Bus Fault). This case is always a Hard Fault. The return PC points to the pre-empted instruction." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FORCED" description="Hard Fault activated because a Configurable Fault was received and cannot activate because of priority or because the Configurable Fault is disabled. The Hard Fault handler then has to read the other fault status registers to determine cause." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DEBUGEVT" description="This bit is set if there is a fault related to debug. This is only possible when halting debug is not enabled. For monitor enabled debug, it only happens for BKPT when the current priority is higher than the monitor. When both halting and monitor debug are disabled, it only happens for debug events that are not ignored (minimally, BKPT). The Debug Fault Status Register is updated." begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
