Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/SCB_356.0.xml
    <register id="DFSR" width="32" offset="0xD30" internal="0" description="Debug Fault Status Register">
        <bitfield id="HALTED" description="Halt request flag. The processor is halted on the next instruction." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="no halt request"/>
            <bitenum id="en_0b1" value="0x1" description="halt requested by NVIC, including step"/>
        </bitfield>
        <bitfield id="BKPT" description="BKPT flag. The BKPT flag is set by a BKPT instruction in flash patch code, and also by normal code. Return PC points to breakpoint containing instruction." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="no BKPT instruction execution"/>
            <bitenum id="en_0b1" value="0x1" description="BKPT instruction execution"/>
        </bitfield>
        <bitfield id="DWTTRAP" description="Data Watchpoint and Trace (DWT) flag. The processor stops at the current instruction or at the next instruction." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="no DWT match"/>
            <bitenum id="en_0b1" value="0x1" description="DWT match"/>
        </bitfield>
        <bitfield id="VCATCH" description="Vector catch flag. When the VCATCH flag is set, a flag in one of the local fault status registers is also set to indicate the type of fault." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="no vector catch occurred"/>
            <bitenum id="en_0b1" value="0x1" description="vector catch occurred"/>
        </bitfield>
        <bitfield id="EXTERNAL" description="External debug request flag. The processor stops on next instruction boundary." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="EDBGRQ signal not asserted"/>
            <bitenum id="en_0b1" value="0x1" description="EDBGRQ signal asserted"/>
        </bitfield>
    </register>
    <register id="MMFAR" width="32" offset="0xD34" internal="0" description="Mem Manage Fault Address Register">
    </register>
    <register id="BFAR" width="32" offset="0xD38" internal="0" description="Bus Fault Address Register">
    </register>
    <register id="AFSR" width="32" offset="0xD3C" internal="0" description="Auxiliary Fault Status Register">
    </register>
    <register id="PFR0" width="32" offset="0xD40" internal="0" description="Processor Feature register0">
        <bitfield id="STATE0" description="State0 (T-bit == 0)" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no ARM encoding"/>
            <bitenum id="en_0b0001" value="0x1" description="N/A"/>
        </bitfield>
        <bitfield id="STATE1" description="State1 (T-bit == 1)" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="N/A"/>
            <bitenum id="en_0b0001" value="0x1" description="N/A"/>
            <bitenum id="en_0b0010" value="0x2" description="Thumb-2 encoding with the 16-bit basic instructions plus 32-bit Buncond/BL but no other 32-bit basic instructions (Note non-basic 32-bit instructions can be added using the appropriate instruction attribute, but other 32-bit basic instructions cannot.)"/>
            <bitenum id="en_0b0011" value="0x3" description="Thumb-2 encoding with all Thumb-2 basic instructions"/>
        </bitfield>
    </register>
    <register id="PFR1" width="32" offset="0xD44" internal="0" description="Processor Feature register1">
        <bitfield id="MICROCONTROLLER_PROGRAMMERS_MODEL" description="Microcontroller programmer&apos;s model" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="not supported"/>
            <bitenum id="en_0b0010" value="0x2" description="two-stack support"/>
        </bitfield>
    </register>
    <register id="DFR0" width="32" offset="0xD48" internal="0" description="Debug Feature register0">
        <bitfield id="MICROCONTROLLER_DEBUG_MODEL" description="Microcontroller Debug Model - memory mapped" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="not supported"/>
            <bitenum id="en_0b0001" value="0x1" description="Microcontroller debug v1 (ITMv1, DWTv1, optional ETM)"/>
        </bitfield>
    </register>
    <register id="AFR0" width="32" offset="0xD4C" internal="0" description="Auxiliary Feature register0">
    </register>
    <register id="MMFR0" width="32" offset="0xD50" internal="0" description="Memory Model Feature register0">
        <bitfield id="PMSA_SUPPORT" description="PMSA support" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="not supported"/>
            <bitenum id="en_0b0001" value="0x1" description="IMPLEMENTATION DEFINED (N/A)"/>
            <bitenum id="en_0b0010" value="0x2" description="PMSA base (features as defined for ARMv6) (N/A)"/>
            <bitenum id="en_0b0011" value="0x3" description="PMSAv7 (base plus subregion support)"/>
        </bitfield>
        <bitfield id="CACHE_COHERENCE_SUPPORT" description="Cache coherence support" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no shared support"/>
            <bitenum id="en_0b0001" value="0x1" description="partial-inner-shared coherency (coherency amongst some - but not all - of the entities within an inner-coherent domain)"/>
            <bitenum id="en_0b0010" value="0x2" description="full-inner-shared coherency (coherency amongst all of the entities within an inner-coherent domain)"/>
            <bitenum id="en_0b0011" value="0x3" description="full coherency (coherency amongst all of the entities)"/>
        </bitfield>
        <bitfield id="OUTER_NON_SHARABLE_SUPPORT" description="Outer non-sharable support" begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="Outer non-sharable not supported"/>
            <bitenum id="en_0b0001" value="0x1" description="Outer sharable supported"/>
        </bitfield>
        <bitfield id="AUXILIARY_REGISTER_SUPPORT" description="Auxiliary register support" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="not supported"/>
            <bitenum id="en_0b0001" value="0x1" description="Auxiliary control register"/>
        </bitfield>
    </register>
    <register id="MMFR1" width="32" offset="0xD54" internal="0" description="Memory Model Feature register1">
    </register>
    <register id="MMFR2" width="32" offset="0xD58" internal="0" description="Memory Model Feature register2">
        <bitfield id="WAIT_FOR_INTERRUPT_STALLING" description="wait for interrupt stalling" begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="not supported"/>
            <bitenum id="en_0b0001" value="0x1" description="wait for interrupt supported"/>
        </bitfield>
    </register>
