Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/SCB_356.0.xml
    <register id="MMFR3" width="32" offset="0xD5C" internal="0" description="Memory Model Feature register3">
    </register>
    <register id="ISAR0" width="32" offset="0xD60" internal="0" description="ISA Feature register0">
        <bitfield id="BITCOUNT_INSTRS" description="BitCount instructions" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no bit-counting instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds CLZ"/>
        </bitfield>
        <bitfield id="BITFIELD_INSTRS" description="BitField instructions" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no bitfield instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds BFC, BFI, SBFX, UBFX"/>
        </bitfield>
        <bitfield id="CMPBRANCH_INSTRS" description="CmpBranch instructions" begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no combined compare-and-branch instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds CB{N}Z"/>
        </bitfield>
        <bitfield id="COPROC_INSTRS" description="Coprocessor instructions" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no coprocessor support, other than for separately attributed architectures such as CP15 or VFP"/>
            <bitenum id="en_0b0001" value="0x1" description="adds generic CDP, LDC, MCR, MRC, STC"/>
            <bitenum id="en_0b0010" value="0x2" description="adds generic CDP2, LDC2, MCR2, MRC2, STC2"/>
            <bitenum id="en_0b0011" value="0x3" description="adds generic MCRR, MRRC"/>
            <bitenum id="en_0b0100" value="0x4" description="adds generic MCRR2, MRRC2"/>
        </bitfield>
        <bitfield id="DEBUG_INSTRS" description="Debug instructions" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no debug instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds BKPT"/>
        </bitfield>
        <bitfield id="DIVIDE_INSTRS" description="Divide instructions" begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no divide instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds SDIV, UDIV (v1 quotient only result)"/>
        </bitfield>
    </register>
    <register id="ISAR1" width="32" offset="0xD64" internal="0" description="ISA Feature register1">
        <bitfield id="EXTEND_INSRS" description="Extend instructions. Note that the shift options on these instructions are also controlled by the WithShifts_instrs attribute." begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no scalar (i.e. non-SIMD) sign/zero-extend instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds SXTB, SXTH, UXTB, UXTH"/>
            <bitenum id="en_0b0010" value="0x2" description="N/A"/>
        </bitfield>
        <bitfield id="IFTHEN_INSTRS" description="IfThen instructions" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="IT instructions not present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds IT instructions (and IT bits in PSRs)"/>
        </bitfield>
        <bitfield id="IMMEDIATE_INSTRS" description="Immediate instructions" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no special immediate-generating instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds ADDW, MOVW, MOVT, SUBW"/>
        </bitfield>
        <bitfield id="INTERWORK_INSTRS" description="Interwork instructions" begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no interworking instructions supported"/>
            <bitenum id="en_0b0001" value="0x1" description="adds BX (and T bit in PSRs)"/>
            <bitenum id="en_0b0010" value="0x2" description="adds BLX, and PC loads have BX-like behavior"/>
            <bitenum id="en_0b0011" value="0x3" description="N/A"/>
        </bitfield>
    </register>
    <register id="ISAR2" width="32" offset="0xD68" internal="0" description="ISA Feature register2">
        <bitfield id="LOADSTORE_INSTRS" description="LoadStore instructions" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no additional normal load/store instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds LDRD/STRD"/>
        </bitfield>
        <bitfield id="MEMHINT_INSTRS" description="MemoryHint instructions" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no memory hint instructions presen"/>
            <bitenum id="en_0b0001" value="0x1" description="adds PLD"/>
            <bitenum id="en_0b0010" value="0x2" description="adds PLD (ie a repeat on value 1)"/>
            <bitenum id="en_0b0011" value="0x3" description="adds PLI"/>
        </bitfield>
        <bitfield id="MULTIACCESSINT_INSTRS" description="Multi-Access interruptible instructions" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="the (LDM/STM) instructions are non-interruptible"/>
            <bitenum id="en_0b0001" value="0x1" description="the (LDM/STM) instructions are restartable"/>
            <bitenum id="en_0b0010" value="0x2" description="the (LDM/STM) instructions are continuable"/>
        </bitfield>
        <bitfield id="MULT_INSTRS" description="Multiply instructions" begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="only MUL present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds MLA"/>
            <bitenum id="en_0b0010" value="0x2" description="adds MLS"/>
        </bitfield>
        <bitfield id="MULTS_INSTRS" description="Multiply instructions (advanced, signed)" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no signed multiply instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds SMULL, SMLAL"/>
            <bitenum id="en_0b0010" value="0x2" description="N/A"/>
            <bitenum id="en_0b0011" value="0x3" description="N/A"/>
        </bitfield>
        <bitfield id="MULTU_INSTRS" description="Multiply instructions (advanced, unsigned)" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no unsigned multiply instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds UMULL, UMLAL"/>
            <bitenum id="en_0b0010" value="0x2" description="N/A"/>
        </bitfield>
        <bitfield id="REVERSAL_INSTRS" description="Reversal instructions" begin="31" end="28" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no reversal instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds REV, REV16, REVSH"/>
            <bitenum id="en_0b0010" value="0x2" description="adds RBIT"/>
        </bitfield>
    </register>
    <register id="ISAR3" width="32" offset="0xD6C" internal="0" description="ISA Feature register3">
        <bitfield id="SATRUATE_INSTRS" description="Saturate instructions" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no non-SIMD saturate instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="N/A"/>
        </bitfield>
        <bitfield id="SIMD_INSTRS" description="SIMD instructions" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no SIMD instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds SSAT, USAT (and the Q flag in the PSRs)"/>
            <bitenum id="en_0b0011" value="0x3" description="N/A"/>
        </bitfield>
        <bitfield id="SVC_INSTRS" description="SVC instructions" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no SVC (SWI) instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds SVC (SWI)"/>
        </bitfield>
        <bitfield id="SYNCPRIM_INSTRS" description="SyncPrim instructions. Note there are no LDREXD or STREXD in ARMv7-M. This attribute is used in conjunction with the SyncPrim_instrs_frac attribute in ID_ISAR4[23:20]." begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no synchronization primitives present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds LDREX, STREX"/>
            <bitenum id="en_0b0010" value="0x2" description="adds LDREXB, LDREXH, LDREXD, STREXB, STREXH, STREXD, CLREX(N/A)"/>
        </bitfield>
        <bitfield id="TABBRANCH_INSTRS" description="TableBranch instructions" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no table-branch instructions present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds TBB, TBH"/>
        </bitfield>
        <bitfield id="THUMBCOPY_INSTRS" description="ThumbCopy instructions" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="Thumb MOV(register) instruction does not allow low reg - low reg"/>
            <bitenum id="en_0b0001" value="0x1" description="adds Thumb MOV(register) low reg - low reg and the CPY alias"/>
        </bitfield>
        <bitfield id="TRUENOP_INSTRS" description="TrueNOP instructions" begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="true NOP instructions not present - that is, NOP instructions with no register dependencies"/>
            <bitenum id="en_0b0001" value="0x1" description="adds &quot;true NOP&quot;, and the capability of additional &quot;NOP compatible hints&quot;"/>
        </bitfield>
    </register>
    <register id="ISAR4" width="32" offset="0xD70" internal="0" description="ISA Feature register4">
        <bitfield id="UNPRIV_INSTRS" description="Unprivileged instructions" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no &quot;T variant&quot; instructions exist"/>
            <bitenum id="en_0b0001" value="0x1" description="adds LDRBT, LDRT, STRBT, STRT"/>
            <bitenum id="en_0b0010" value="0x2" description="adds LDRHT, LDRSBT, LDRSHT, STRHT"/>
        </bitfield>
        <bitfield id="WITHSHIFTS_INSTRS" description="WithShift instructions. Note that all additions only apply in cases where the encoding supports them - e.g. there is no difference between levels 3 and 4 in the Thumb-2 instruction set. Also note that MOV instructions with shift options should instead be treated as ASR, LSL, LSR, ROR or RRX instructions." begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="non-zero shifts only support MOV and shift instructions (see notes)"/>
            <bitenum id="en_0b0001" value="0x1" description="shifts of loads/stores over the range LSL 0-3"/>
            <bitenum id="en_0b0010" value="0x3" description="adds other constant shift options."/>
            <bitenum id="en_0b0100" value="0x4" description="adds register-controlled shift options."/>
        </bitfield>
        <bitfield id="WRITEBACK_INSTRS" description="Writeback instructions" begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="only non-writeback addressing modes present, except that LDMIA/STMDB/PUSH/POP instructions support writeback addressing."/>
            <bitenum id="en_0b0001" value="0x1" description="adds all currently-defined writeback addressing modes (ARMv7, Thumb-2)"/>
        </bitfield>
        <bitfield id="BARRIER_INSTRS" description="Barrier instructions" begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no barrier instructions supported"/>
            <bitenum id="en_0b0001" value="0x1" description="adds DMB, DSB, ISB barrier instructions"/>
        </bitfield>
        <bitfield id="SYNCPRIM_INSTRS_FRAC" description="SyncPrim_instrs_frac" begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="no additional support"/>
            <bitenum id="en_0b0011" value="0x3" description="adds CLREX, LDREXB, STREXB, LDREXH, STREXH"/>
        </bitfield>
        <bitfield id="PSR_M_INSTRS" description="PSR_M_instrs" begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="en_0b0000" value="0x0" description="instructions not present"/>
            <bitenum id="en_0b0001" value="0x1" description="adds CPS, MRS, and MSR instructions (M-profile forms)"/>
        </bitfield>
    </register>
    <register id="CPACR" width="32" offset="0xD88" internal="0" description="Coprocessor Access Control Register">
        <bitfield id="CP11" description="Access privileges for coprocessor 11. The possible values of each field are: 0b00 = Access denied. Any attempted access generates a NOCP UsageFault. 0b01 = Privileged access only. An unprivileged access generates a NOCP UsageFault. 0b10 = Reserved. 0b11 = Full access. Used in conjunction with the control for CP10, this controls access to the Floating Point Coprocessor." begin="23" end="22" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="CP10" description="Access privileges for coprocessor 10. The possible values of each field are: 0b00 = Access denied. Any attempted access generates a NOCP UsageFault. 0b01 = Privileged access only. An unprivileged access generates a NOCP UsageFault. 0b10 = Reserved. 0b11 = Full access. Used in conjunction with the control for CP11, this controls access to the Floating Point Coprocessor." begin="21" end="20" width="2" rwaccess="R/W">
        </bitfield>
    </register>
</module>
